CSI API ETABS v1
cAnalysisResults.AreaStrainShellLayered Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AreaStrainShellLayered(
	string Name,
	eItemTypeElm ItemTypeElm,
	ref int NumberResults,
	ref string[] obj,
	ref string[] elm,
	ref string[] Layer,
	ref int[] IntPtNum,
	ref double[] IntPtLoc,
	ref string[] PointElm,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] E11,
	ref double[] E22,
	ref double[] G12,
	ref double[] EMax,
	ref double[] EMin,
	ref double[] EAngle,
	ref double[] EVM,
	ref double[] G13avg,
	ref double[] G23avg,
	ref double[] GMaxavg,
	ref double[] GAngleavg
)
Function AreaStrainShellLayered (
	Name As String,
	ItemTypeElm As eItemTypeElm,
	ByRef NumberResults As Integer,
	ByRef obj As String(),
	ByRef elm As String(),
	ByRef Layer As String(),
	ByRef IntPtNum As Integer(),
	ByRef IntPtLoc As Double(),
	ByRef PointElm As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef E11 As Double(),
	ByRef E22 As Double(),
	ByRef G12 As Double(),
	ByRef EMax As Double(),
	ByRef EMin As Double(),
	ByRef EAngle As Double(),
	ByRef EVM As Double(),
	ByRef G13avg As Double(),
	ByRef G23avg As Double(),
	ByRef GMaxavg As Double(),
	ByRef GAngleavg As Double()
) As Integer
Dim instance As cAnalysisResults
Dim Name As String
Dim ItemTypeElm As eItemTypeElm
Dim NumberResults As Integer
Dim obj As String()
Dim elm As String()
Dim Layer As String()
Dim IntPtNum As Integer()
Dim IntPtLoc As Double()
Dim PointElm As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim E11 As Double()
Dim E22 As Double()
Dim G12 As Double()
Dim EMax As Double()
Dim EMin As Double()
Dim EAngle As Double()
Dim EVM As Double()
Dim G13avg As Double()
Dim G23avg As Double()
Dim GMaxavg As Double()
Dim GAngleavg As Double()
Dim returnValue As Integer
returnValue = instance.AreaStrainShellLayered(Name,
	ItemTypeElm, NumberResults, obj,
	elm, Layer, IntPtNum, IntPtLoc, PointElm,
	LoadCase, StepType, StepNum, E11,
	E22, G12, EMax, EMin, EAngle, EVM, G13avg,
	G23avg, GMaxavg, GAngleavg)
int AreaStrainShellLayered(
	String^ Name,
	eItemTypeElm ItemTypeElm,
	int% NumberResults,
	array<String^>^% obj,
	array<String^>^% elm,
	array<String^>^% Layer,
	array<int>^% IntPtNum,
	array<double>^% IntPtLoc,
	array<String^>^% PointElm,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% E11,
	array<double>^% E22,
	array<double>^% G12,
	array<double>^% EMax,
	array<double>^% EMin,
	array<double>^% EAngle,
	array<double>^% EVM,
	array<double>^% G13avg,
	array<double>^% G23avg,
	array<double>^% GMaxavg,
	array<double>^% GAngleavg
)
abstract AreaStrainShellLayered :
        Name : string *
        ItemTypeElm : eItemTypeElm *
        NumberResults : int byref *
        obj : string[] byref *
        elm : string[] byref *
        Layer : string[] byref *
        IntPtNum : int[] byref *
        IntPtLoc : float[] byref *
        PointElm : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        E11 : float[] byref *
        E22 : float[] byref *
        G12 : float[] byref *
        EMax : float[] byref *
        EMin : float[] byref *
        EAngle : float[] byref *
        EVM : float[] byref *
        G13avg : float[] byref *
        G23avg : float[] byref *
        GMaxavg : float[] byref *
        GAngleavg : float[] byref -> int
Parameters
Name
Type: System.String
ItemTypeElm
Type: ETABSv1.eItemTypeElm
NumberResults
Type: System.Int32
obj
Type: System.String[]
elm
Type: System.String[]
Layer
Type: System.String[]
IntPtNum
Type: System.Int32[]
IntPtLoc
Type: System.Double[]
PointElm
Type: System.String[]
LoadCase
Type: System.String[]
StepType
Type: System.String[]
StepNum
Type: System.Double[]
E11
Type: System.Double[]
E22
Type: System.Double[]
G12
Type: System.Double[]
EMax
Type: System.Double[]
EMin
Type: System.Double[]
EAngle
Type: System.Double[]
EVM
Type: System.Double[]
G13avg
Type: System.Double[]
G23avg
Type: System.Double[]
GMaxavg
Type: System.Double[]
GAngleavg
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace